import styled from "@emotion/styled";
import RedTitle from "../layout/RedTitle";
import Performance from "./Performance";
import { useState } from "react";
import useWindowDimensions from "../../hooks/useWindowDimensions";

export const TestArr = [
  {
    title: "Лютий",
    description:
      "«ЛЮТИЙ» — це простір, де не тільки словами вивільняється внутрішня боротьба, а й — рухами, музикою, звуком і світлом. Це перформований діалог і безпечне місця для кожного_ї, хто потребує бути не в самоті зі своїми почуттями. Це спільний пошук власної ідентичності в контексті війни, що є нашою реальністю нині.",
    type: "Перформативна вистава",
    date: "12.04",
    imgUrl: "/icons/poster/img1.png",
    link: "war",
    largeDescription: {
      imgUrl: "/icons/poster/bigImg1.png",
      videoRemarks: [
        "*У виставі лунає жива музика",
        "**Після вистави є можливість придбати її мерч – автоорську п’єсу",
      ],
      bigTitle1: "Лютий завжди був",
      bigTitle2: "холодним...",
      smallTitle: "«ЛЮТИЙ» — це простір, де вивільняється внутрішня боротьба",
      description:
        "<p>Лютий завжди був холодним місяцем, але в цьому році він став холодним по-особливому. </p>" +
        "<p>Ми об’єдналися тапрацюємо на спільну мету. Для нас є важливою кожна історія та кожне свідчення, нам важливо їх задокументувати й не загубити в ході історії.</p>" +
        "<p>Створення свого роду мапи нашої країни, сплетеної із думок, почуттів та історій представників_иць різних регіонів і професій, лягло в основу вистави «ЛЮТИЙ». </p>." +
        "<p>Були атаковані не тільки кордони нашої держави, а й наші власні. Вистава досліджує руйнівні відчуття люті, ненависті й щось їх засильніше, що не описати словами.</p>",
      images: [
        "/icons/performances/februar1.png",
        "/icons/performances/februar2.png",
        "/icons/performances/februar3.png",
      ],
      composition: [
        {
          name: "Артем Вусик",
          abilities: ["режисер", "сценарист", "світлове оформлення"],
        },
        {
          name: "Ліза Прасолова",
          abilities: ["акторка", "Виготовлення декорацій"],
        },
        {
          name: "Леся Стрельбіцька",
          abilities: ["Сценографістка", "Виготовлення декорацій"],
        },
        { name: "Арсеній Бутирін", abilities: ["Музичне оформдення"] },
        { name: "Роман Трубчвнінов", abilities: ["Музичне оформдення"] },
        { name: "Антон Репях", abilities: ["Актор", "Виготовлення декорацій"] },
        {
          name: "Артур Слісаренко",
          abilities: ["Актор", "Виготовлення декорацій"],
        },
      ],
    },
  },
  {
    title: "Леся і Андрій зустрічаються у Львові",
    description:
      "Це історія двох дітей - Лесі та Андрія, котрі під час війни опинилися у Львові, який прихистив \n" +
      "їх від снарядів, що розриваються у їхніх рідних містах.\n" +
      "Познайомившись, вони розпочинають свої пригоди та сміливо допомагають країні боротися зі злом.",
    type: "лялькова вистава",
    date: "22.08",
    imgUrl: "/icons/poster/img2.png",
    link: "meting",
    largeDescription: {
      imgUrl: "/icons/poster/bigImg2.png",
      videoRemarks: [
        "*У виставі лунає жива музика",
        "**Після вистави є можливість придбати її мерч – автоорську п’єсу",
      ],
      bigTitle1: "Чому Леся так",
      bigTitle2: "швидко їде?",
      smallTitle:
        "-Ну ти ж повернешся, Лесю?\n" +
        "-Обов'язково повернуся, Андрію..!\n" +
        "-А коли?\n" +
        "-Ох, не знаю..",
      description:
        "<p>Війна змушує частіше розставатись, але палкіше любити. Діти виражають почуття чесніше, взаємодіють щиріше. Наша лялькова вистава про це.</p>" +
        "<p>Маленькі, але сміливі серцем Леся і Андрій хочуть допомогти країні, й тому виконують різні завдання,\n" +
        "      які трапляються на їхньому шляху. Вони відчувають\n" +
        "      свої силу, впевненість дужче, коли знаходяться разом.</p>." +
        "<pПідтримка, внутрішня радість і бажання допомогти вколисуються у душах наших героїв_їнь. Епізодичних\n" +
        "      або головних.</p>." +
        "<p>Це наша добра історія Лесі та Андрія, сповнена пригод, взаємності, щемливості та надії з порошинками чарівності.</p>.",
      images: [
        "/icons/performances/februar1.png",
        "/icons/performances/februar2.png",
        "/icons/performances/februar3.png",
      ],
      composition: [
        {
          name: "Артем Вусик",
          abilities: ["режисер", "сценарист", "Світлове оформлення"],
        },
        {
          name: "Ліза Прасолова",
          abilities: ["Перформерка", "Виготовлення декорацій"],
        },
        {
          name: "Леся Стрельбіцька",
          abilities: ["Сценографістка", "Виготовлення декорацій"],
        },
        { name: "Арсеній Бутирін", abilities: ["Музичне оформдення"] },
        { name: "Роман Трубчвнінов", abilities: ["Музичне оформдення"] },

        {
          name: "Антон Репях",
          abilities: ["Актор", "Виготовлення декорацій"],
        },
        {
          name: "Артур Слісаренко",
          abilities: ["Актор", "Виготовлення декорацій"],
        },
      ],
    },
  },
  {
    title: "Як я познайомився з війною і майже вбив путіна",
    description:
      "\n" +
      "Вистава, є автобіографічною історією від першої особи, що поєднується із сюреалістично фантазійною лінією спроби вбивства путіна. \n" +
      "Це симбіоз аудіального театру з музичним \n" +
      "перфо-концертом; історія пригод і пошуків свого нового місця через втрату попереднього життя.\n" +
      "\n",
    type: "вистава–концерт",
    date: "11.06",
    imgUrl: "/icons/poster/img3.png",
    link: "kill-pupin",
    largeDescription: {
      imgUrl: "/icons/poster/bigImg3.png",
      videoRemarks: [
        "*У виставі лунає жива музика",
        "**Спільний проєкт театру Лесі та театру Варта",
      ],
      bigTitle1: "Що спонукає людину",
      bigTitle2: "до вбивства?",
      smallTitle: "Яке воно — знайомство з війною?",
      description:
        "<p>Що може спонукнути людину до думки про вбивство? Можливо, те, що вона сама під загрозою вбивства й кожного дня бачить, як вбивають людей її держави?</p>" +
        "<p>У цій виставі переплітаються експериментальна музика, сновидіння і фантазії про смерть путіна. Сюреалістична постановка з елементами ґлему та мареннями — як вам таке? </p>" +
        "<p>Як це — зображувати того, кого кожного дня, проклинаючи, згадують сотні людей? </p>" +
        "<p>Вистава у жанрі аудіально-перформативного концерту є автобіографічною історією від першої особи, що поєднується із сюреалістично фантазійною лінією спроби вбивства путіна центральним героєм твору.</p>" +
        "<p>Це симбіоз аудіального театру з музичним перфо-концертом; історія пригод і пошуків свого нового місця через втрату попереднього життя.</p>" +
        "<p>Має бути круто, як у раннього Тома Вейтса.</p>",
      images: [
        "/icons/performances/warmeet1.png",
        "/icons/performances/warmeet2.png",
        "/icons/performances/warmeet3.png",
      ],
      composition: [
        {
          name: "Артем Вусик",
          abilities: ["режисер", "сценарист", "Актор"],
        },
        {
          name: "Ліза Прасолова",
          abilities: ["Перформерка", "Виготовлення декорацій"],
        },
        {
          name: "Леся Стрельбіцька",
          abilities: ["Перформерка", "Сценографістка"],
        },
        { name: "Арсеній Бутирін", abilities: ["Музичне оформдення"] },
        {
          name: "Юрій Сулик",
          abilities: ["Перформер", "Музичне оформлення"],
        },
        {
          name:
            "Аким Драгомирецький, Іван Дробот, Тарас Волох, Руслана Петрякова, Костянтин Васюков, Артур Рожицький, Тарас Волох,  Артур Слісаренко, \n" +
            "Антон Репях, Даніїл Пеліхат",
          abilities: ["Перформери"],
        },
      ],
    },
  },
  {
    title: "Херсон Незламний",
    description:
      "Події розгортаються ніби в партизанському штабі, де оповідачі_ка ведуть дію, використовуючи історії людей, які жили_вуть у Херсонській області. Обшуки, знущання, вбивства, викрадення, зґвалтування, сльози на очах і в серці — це реалії нині, які щоденно кояться армією рф.",
    type: "вистава–читка",
    date: "04.22",
    imgUrl: "/icons/poster/img4.png",
    link: "herson",
    largeDescription: {
      imgUrl: "/icons/poster/bigImg4.png",
      videoRemarks: [
        "*У виставі лунає жива музика",
        " **Використовується обсценна лексика",
      ],
      bigTitle1: "Ситуація складна...",
      bigTitle2: "",
      smallTitle:
        "Коли настане мить, коли над Херсоном знову замайорить український стяг?",
      description:
        "<p>Події розгортаються ніби в партизанському штабі, де оповідачі_ка ведуть дію, використовуючи історії людей, які жили_вуть у Херсонській області. Армія рф щоденно порушує норми міжнародного права. Обшуки, знущання, вбивства, викрадення, зґвалтування, сльози на очах і в серці — це реалії нині. Чи є місце в такому моторошному\n" +
        "та бентежному стані творчости, насамперед — поезії?</p>" +
        "<p>Що відчувають діти, адже їхнє дитинство нахабно відбирають? Чому по дорозі з області в область люди тільки те й роблять, що моляться, аби вижити? Вижити. Життя — найперше право кожної людини.\n</p>" +
        "<p>Є і ті, хто не боїться кожного разу розмовляти на тимчасово окупованих територіях українською, або висловлюватися на рос.тб про те, що бажає жити саме\n" +
        "в Україні. Не боїться тому, що злість на цю нелюдськість уже не має меж. Сьогодні ми могли б говорити про цивілізаційний прогрес, але з рос.середньовічного табору знову виповз людожер із очима, в яких тільки порожнеча й ненависть.Зупинити його можна тільки силою. Разом у нас усе вийде, ми ніколи не здамося.\n" +
        "</p>.",
      images: [
        "/icons/performances/kherson1.png",
        "/icons/performances/kherson2.png",
        "/icons/performances/kherson3.png",
      ],
      composition: [
        {
          name: "Артем Вусик",
          abilities: ["режисер", "сценарист"],
        },
        {
          name: "Ніна Хижна",
          abilities: ["Режисер Пластики"],
        },
        {
          name: "Леся Стрельбіцька",
          abilities: ["Музичне оформдення", "Перформерка", "Сценографістка"],
        },
        { name: "Арсеній Бутирін", abilities: ["Музичне оформдення"] },
        { name: "Іван Корольов", abilities: ["Музичне оформдення"] },
        {
          name: "Тарас Воло, Артур Рожицький, Ліза Прасолова, Антон Репях, Артур Слісаренко",
          abilities: ["Перформери", "Музичне оформлення"],
        },
      ],
    },
  },
  {
    title: "Вона Війна",
    description:
      "Яким є жіночий досвід війни? Досвід кожної із нас, яку ви бачите в трамваї або в стрічці новин. Один\n" +
      " і той самий біль, один і той самий жах, нещадно встромлений у спину. Кожна з нас носить цей ніж \n" +
      "у спині та скільки є сил, можливостей бореться \n" +
      "за кожну спокійну хвилину",
    type: "моно–вистава ",
    date: "05.09",
    imgUrl: "/icons/poster/img5.png",
    link: "she-is-war",
    largeDescription: {
      imgUrl: "/icons/poster/bigImg5.png",
      videoRemarks: [],
      bigTitle1: "Яким є жіночий",
      bigTitle2: "досвід війни?",
      smallTitle:
        "Досвід кожної із нас, \n" +
        "яку ви бачите в трамваї \n" +
        "або в стрічці новин.",
      description:
        "<p> Ця вистава звучить голосами жінок, дівчат, які розповідають про свої випробування у часи війни. \n" +
        "Про еміграцію, нерівність, виклики, шляхи подолання психологічної кризи та відновлення моральної стійкості.\n" +
        "Деякі з історій сформували архетипи, що відтворені \n" +
        "на сцені, деякі залишилися живим голосом. Разом \n" +
        "усі слова складають різномаїтий портрет сучасної української жінки.</p>" +
        "<p>     Для збору документального матеріалу режисер та акторка опитували знайомих жінок дистанційно, волонтерили\n" +
        "      на вокзалі, відвідували шелтери для біженців_ок, зустрічались та записували історії. З жіночих оповідей складалася п’єса, створювалися нові персонажки. Але на кожному етапі створення вистави головним правилом, яким керувалися автори_ки, була документальна правдивість.\n</p>" +
        "<p>Один і той самий біль, один і той самий жах, нещадно встромлений у спину. Кожна з нас носить цей ніж у спині та скільки є сил, можливостей бореться за кожну спокійну хвилину. Духовну чи фізичну. Свою або чужу.</p>.",
      images: [
        "/icons/performances/sheswar1.png",
        "/icons/performances/sheswar2.png",
        "/icons/performances/sheswar3.png",
      ],
      composition: [
        {
          name: "Костянтин Васюков",
          abilities: ["режисер", "Співавтор сценарію"],
        },
        {
          name: "Світлана Мельник",
          abilities: ["Акторка", "Співавторка сценарію"],
        },
        {
          name: "Леся Стрельбіцька",
          abilities: ["Сценографістка"],
        },
        {
          name: "Володимир Понікаровський",
          abilities: ["Композитор", "Саунд–дизайнер"],
        },
        {
          name: "Денис Бєляєв",
          abilities: ["Медіа–художник", "режисер монтажу"],
        },
        {
          name: "Денис Бєляєв і Тамілла Гамзаєва",
          abilities: ["2d–анімація"],
        },
      ],
    },
  },
  {
    title: "Перший День Війни",
    description:
      "Перфоменс-рефлексія, створений у перші дні становлення театру Варта. Перфоменс-оповідання історій кожного_ої з нас у русі, слові, світлині чи музиці. Перфоменс-надія на те, що кожного дня ми стаємо на крок ближче до перемоги.",
    type: "лялькова вистава",
    date: "23.07",
    imgUrl: "/icons/poster/img6.png",
    link: "first-day",
    largeDescription: {
      imgUrl: "/icons/poster/bigImg6.png",
      videoRemarks: ["*Присутня обсценна лексика"],
      bigTitle1: "Закарбувався в нас",
      bigTitle2: "назавжди...",
      smallTitle: "напружено затамувався подих наш тоді назавжди.",
      description:
        "<p> Перший день війни закарбувався у нас назавжди, напружено затамувався подих наш тоді назавжди.</p>" +
        "<p>Тоді, рано-вранці, ніхто не думав_ла, що житиме інакше, стамувавши подих і навпошепки, навпомацки, крізь новітні реалії пробиратиметься до подоби мирного життя. Гіркої подоби з щоденними новинами, що не вкладаються ні\n" +
        "      в голові, ні в серці.</p>" +
        "<p> Нині ми проживаємо схоже, співчуваємо та очікуємо\n" +
        "      на одне й те ж. Аби одного разу, так само - рано-вранці,\n" +
        "      ми прокинулись і перемогли. </p>." +
        "<p>Але на цій перфомативній виставі давайте спробуємо видихнути хоча б часточку того лютневого, безжально спертого в душах, повітря.</p>" +
        "<p> Ця вистава - це наші переосмислення, взаєморозуміння та підтримка, дивлячись на все це. Це наш спільний видих.</p>.",
      images: [
        "/icons/performances/firstday1.png",
        "/icons/performances/firstday2.png",
        "/icons/performances/firstday3.png",
      ],
      composition: [
        {
          name: "Артем Вусик",
          abilities: ["режисер", "сценарист", "Світлове оформлення"],
        },
        {
          name: "Ліза Прасолова",
          abilities: ["Перформерка", "Виготовлення декорацій"],
        },
        {
          name: "Леся Стрельбіцька",
          abilities: ["Перформерка", "Сценографістка"],
        },
        { name: "Арсеній Бутирін", abilities: ["Музичне оформдення"] },
        {
          name: "Юрій Сулик",
          abilities: ["Перформер", "Музичне оформлення"],
        },
        {
          name:
            "Аким Драгомирецький, Іван Дробот, Тарас Волох, Руслана Петрякова, Костянтин Васюков, Артур Рожицький, Тарас Волох,  Артур Слісаренко, \n" +
            "Антон Репях, Даніїл Пеліхат",
          abilities: ["Перформери"],
        },
      ],
    },
  },
];

const TheaterPoster = () => {
  const { width, maxMobileWidth } = useWindowDimensions();
  const [currentPerformance, setCurrentPerformance] = useState<
    number | undefined
  >(0);

  console.log(currentPerformance, "POSTER");

  return (
    <Wrap id="poster">
      <RedTitle text="що ми робимо?" />
      <Title>вистави</Title>
      <Description>
        Зустрівшись під одним дахом, ми зрозуміли, що наші цінності й думки
        збігаються, та через рефлексію створили виставу “Перший День Війни”.
        <br />
        Але на цьому ми не зупинились і створили повноційнний театр, в якому ми
        говоримо про всі важливі думки, що дивуть в наших головах.
      </Description>
      <PerformancesWrap>
        {TestArr.map((performance, index) => (
          <Performance
            key={index}
            left={(index + 1) % 2}
            title={performance.title}
            description={performance.description}
            type={performance.type}
            date={performance.date}
            imgUrl={performance.imgUrl}
            link={performance.link}
            currentPerformance={currentPerformance}
            setCurrentPerformance={setCurrentPerformance}
            isOpen={
              width > maxMobileWidth ? true : currentPerformance === index
            }
            index={index}
            isLast={TestArr.length - 1 === index}
          />
        ))}
      </PerformancesWrap>
    </Wrap>
  );
};

export default TheaterPoster;

const Wrap = styled.div`
  display: flex;
  flex-direction: column;
  align-items: flex-start;
  padding: 14vh 4vw 0;
  width: 100vw;

  @media (max-width: 960px) {
    padding: 0 4vw;
  }
`;
const Description = styled.span`
  font-family: "namu-1750";
  font-size: 2.4vh;
  color: #b5b5b5;
  width: 36vw;
  padding: 8vh 4vw 0 0;
  margin-left: auto;
  @media (max-width: 960px) {
    width: 86vw;
    margin-left: 6vw;
  }
`;
const PerformancesWrap = styled.div`
  display: flex;
  flex-direction: column;
  margin-top: 12vh;
`;
const Title = styled.span`
  text-transform: uppercase;
  font-family: "namu-1400";
  font-size: 24vh;
  margin-left: -1vw;
  color: #fff;
  @media (max-width: 960px) {
    margin-top: 1vh;
    font-size: 6vh;
  }
`;
