export const TestArr = [
  {
    performanceColor: "#CB6565",
    mobileColor: {
      color: "#414040",
      opacity: 0.67,
    },
    rate: "6+",
    title: "Всередині моєї кімнати",
    description:
      "Ця вистава — про пам‘ять і відновлення зв‘язків між минулим і теперішнім.\n" +
      "Ця вистава — про повернення додому, \n" +
      "про його пошуки: зовні та всередині.\n" +
      "Ця вистава — про мою кімнату.",
    type: "перфомативно-містична вистава",
    buyLink: "https://ticketclub.com.ua/event/5875/?session=14500",
    date: "20.02",
    imgUrl: "/icons/poster/img0.webp",
    link: "inside-my-room",
    largeDescription: {
      imgUrl: "/icons/poster/bigImg0.webp",
      videoRemarks: [
        "У виставі лунає жива музика",
        "Вистава створена за фінансової підтримки Goethe-Institut",
      ],
      bigTitle1: "Той самий",
      bigTitle2: "довгоочікувaний момент",
      smallTitle:
        "Ми хочемо вірити,<br/>що зможемо це<br/>витримати й залишитиcя<br/>cамими cобою.",
      description:
        "<p>«Той самий довгоочікуваний момент, та подія, яка довгий час була наче мрія, наче марево.\n" +
        "Це, напевно, була несвідома головна мета — нарешті опинитися удома. Певна ціль, яка після її досягнення, дарує відчуття зустрічі \n" +
        "з втраченим, зі своїм рідним.»</p>\n" +
        "\n" +
        "<p>Ми хочемо говорити про наші домівки, \n" +
        "про ті місця, які дарували нам відчуття\n" +
        "безпеки та спокою. Ми хочемо розповідати наші історії та відчувати, що ми не самотні \n" +
        "в цьому досвіді. Ми хочемо вірити, що зможемо все це витримати й залишитися самими собою.Ми хочемо реконструювати кожен фрагмент нашого життя, щоби нічого \n" +
        "не забути й рушити далі.</p>\n" +
        "\n" +
        "<p>Ця вистава — про пам‘ять і відновлення зв‘язків між минулим і теперішнім.\n" +
        "Ця вистава — про повернення додому, \n" +
        "про його пошуки: зовні та всередині.\n" +
        "Ця вистава — про мою кімнату.</p>",
      images: [
        "/icons/performances/room1.webp",
        "/icons/performances/room2.webp",
        "/icons/performances/room3.webp",
      ],
      composition: [
        {
          name: "Артем Вусик",
          abilities: ["Режисер"],
        },
        {
          name: "Hіна Хижна",
          abilities: ["Акторка"],
        },

        {
          name: "Данило Білоус",
          abilities: ["Музичне оформлення"],
        },
        {
          name: "Андрій Кізім",
          abilities: ["Музичне оформлення"],
        },
        {
          name: "Олександр Чиж",
          abilities: ["Світлорежисер"],
        },
        {
          name: "Антон Репях",
          abilities: ["світлотехнік"],
        },
        {
          name: "Пабло Бучман",
          abilities: ["Звукорежисер"],
        },
        {
          name: "Андрій Пастернак",
          abilities: ["Дизайн Афіші"],
        },
      ],
      premiere: "20 лютого 2023",
    },
  },
  {
    performanceColor: "#CB6565",
    mobileColor: {
      color: "#2F2F2F",
      opacity: 0.67,
    },
    rate: "16+",
    title: "Лютий",
    description:
      "«ЛЮТИЙ» — це простір, де вивільняється внутрішня боротьба не тільки словами, \n" +
      "а й — рухами, музикою, звуком і світлом. \n" +
      "Це перформований діалог і безпечне місце для всіх, хто потребує бути не на самоті \n" +
      "зі своїми почуттями. Це спільний пошук власної ідентичності в контексті війни, що \n" +
      "є нашою реальністю нині.",
    type: "Перформативна вистава",
    date: "12.04",
    imgUrl: "/icons/poster/img1.webp",
    link: "february",
    largeDescription: {
      imgUrl: "/icons/poster/bigImg1.webp",
      videoRemarks: [
        "У виставі лунає жива музика",
        "Використовується обсценна лексика",
      ],
      bigTitle1: "Лютий завжди був",
      bigTitle2: "холодним...",
      smallTitle:
        "«ЛЮТИЙ» — це простір,<br/> де вивільняється <br/> внутрішня боротьба",
      description:
        "<p>Лютий завжди був холодним місяцем, але \n" +
        "в 2022 році він став холодним по–особливому. \n" +
        "Ми об’єдналися та працюємо задля спільної \n" +
        "мети. Для нас є важливою кожна історія \n" +
        "та кожне свідчення, нам важливо їх задокументувати й не загубити в ході історії.</p>" +
        "<p>Створення свого роду мапи нашої країни, сплетеної із думок, почуттів та історій представників різних регіонів і професій, \n" +
        "лягло в основу постдокументальної вистави «ЛЮТИЙ».</p>" +
        "<p>Були атаковані не тільки кордони нашої держави, а й наші власні. Вистава досліджує руйнівні відчуття люті, ненависті й щось їх засильніше, що не описати словами.</p>",
      images: [
        "/icons/performances/februar1.webp",
        "/icons/performances/februar2.webp",
        "/icons/performances/februar3.webp",
      ],
      composition: [
        {
          name: "Ніна Хижна",
          abilities: ["режисер"],
        },
        {
          name: "Любов Ільницька",
          abilities: ["Драматургиня"],
        },
        {
          name: "Тимофій Ірклієнко",
          abilities: ["Декорації"],
        },
        {
          name: "Володимир Помірко",
          abilities: ["Звукорежисер"],
        },
        {
          name: "Nick Acorne",
          abilities: ["Композитор"],
        },
        {
          name: "Артур Темченко, Любомир Іщук",
          abilities: ["художники зі світла"],
        },
        {
          name: "Graf Prom",
          abilities: ["Дизайн афіші"],
        },
        {
          name: "Владислава Ченцова, Іван Дробот",
          abilities: ["Актори"],
        },
        {
          name: "Олена Баженова, Тарас Волох",
          abilities: ["Актори"],
        },
        {
          name: "Артур Рожицький, Микола Набока",
          abilities: ["Актори"],
        },
        {
          name: "Іван Корольов, Данило Білоус",
          abilities: ["Музиканти"],
        },
        {
          name: "Андрій Кізім",
          abilities: ["Музикант"],
        },
      ],
      premiere: "03 вереcня 2022",
    },
  },
  {
    performanceColor: "#AEA9DB",
    mobileColor: {
      color: "#414040",
      opacity: 0.67,
    },
    rate: "16+",
    title: "Леся і Андрій зустрічаються у Львові",
    description:
      "Це історія двох дітей – Лесі та Андрія, котрі під час війни опинилися у Львові, який прихистив \n" +
      "їх від снарядів, що розриваються у їхніх рідних містах.\n" +
      "Познайомившись, вони розпочинають свої пригоди та сміливо допомагають країні боротися зі злом.",
    type: "вистава театру анімації",
    date: "22.08",
    imgUrl: "/icons/poster/img2.webp",
    link: "meting",
    largeDescription: {
      imgUrl: "/icons/poster/bigImg2.webp",
      videoRemarks: ["У виставі лунає жива музика"],
      bigTitle1: "Чому Леся так",
      bigTitle2: "швидко їде?",
      smallTitle:
        "-Ну ти ж повернешся, Лесю?<br/>" +
        "-Обов'язково повернуся, Андрію..!<br/>" +
        "-А коли?<br/>" +
        "-Ох, не знаю..",
      description:
        "<p>Війна змушує частіше розставатись, але палкіше любити. Діти виражають почуття чесніше,взаємодіють щиріше.</p>" +
        "<p> Наша вистава про це. Маленькі, але сміливі серцем Леся і Андрій хочуть допомогти країні, виконуючи різні завдання, які трапляються \n" +
        "на їхньому шляху. Вони відчувають свої силу, впевненість дужче, коли знаходяться разом.</p>" +
        "<p>Підтримка, внутрішня радість і бажання допомогти вколисуються у душах наших героїв. Епізодичних або головних. Це наша добра історія Лесі та Андрія, сповнена \n" +
        "пригод, взаємности, щемливости й надії \n" +
        "з порошинками чарівности.</p>",
      images: [
        "/icons/performances/landa1.webp",
        "/icons/performances/landa2.webp",
        "/icons/performances/landa3.webp",
      ],
      composition: [
        {
          name: "Артем Вусик",
          abilities: ["режисер", "сценарист", "Світлове оформлення"],
        },
        {
          name: "Ліза Прасолова",
          abilities: ["Перформерка", "Виготовлення декорацій"],
        },
        {
          name: "Олеся Стрельбіцька",
          abilities: ["Сценографістка", "Виготовлення декорацій"],
        },
        { name: "Арсеній Бутирін", abilities: ["Музичне оформдення"] },
        { name: "Роман Трубчвнінов", abilities: ["Музичне оформдення"] },

        {
          name: "Антон Репях",
          abilities: ["Актор", "Виготовлення декорацій"],
        },
        {
          name: "Артур Слісаренко",
          abilities: ["Актор", "Виготовлення декорацій"],
        },
      ],
      premiere: "16 ЧЕРВНЯ 2022",
    },
  },
  {
    performanceColor: "#FFFFFF",
    mobileColor: {
      color: "#ffffff",
      opacity: 0.15,
    },
    rate: "16+",
    title: "Херсон Незламний",
    description:
      "Події розгортаються ніби в партизанському штабі, де оповідачі_ка ведуть дію, використовуючи історії людей, які жили_вуть у Херсонській області. Обшуки, знущання, вбивства, викрадення, зґвалтування, сльози на очах і в серці — це реалії нині, які щоденно кояться армією рф.",
    type: "Вистава–блуканина",
    date: "04.22",
    imgUrl: "/icons/poster/img4.webp",
    link: "unbreakable-kherson",
    largeDescription: {
      imgUrl: "/icons/poster/bigImg4.webp",
      videoRemarks: [
        "У виставі лунає жива музика",
        "Використовується обсценна лексика",
      ],
      bigTitle1: "Ситуація складна...",
      bigTitle2: "",
      smallTitle: "Кінцева точка – cвобода!",
      description:
        "<p>Події розгортаються в партизанському штабі, \n" +
        "де оповідачі ведуть дію, використовуючи історії мешканців Херсонської області. Обшуки, знущання, вбивства, викрадення, зґвалтування, сльози на очах і в серці — це реалії, які щоденно кояться армією рфії. Чи є місце в такому моторошному табентежному стані творчости, насамперед — поезії?</p>" +
        "<p>Що відчувають діти, адже їхнє дитинство нахабно відбирають? Чому по дорозі з області в область \n" +
        "люди тільки те й роблять, що моляться, аби вижити? Вижити. Життя — найголовніше право кожної людини.</p>" +
        "<p>Є і ті, хто не боїться кожного разу говорити на тимчасово окупованих територіях українською, \n" +
        "або висловлюватися на рос.тб про те, що бажає \n" +
        "жити саме в Україні. Не боїться тому, що злість \n" +
        "на цю нелюдськість уже не має меж. Зупинити людожера з очима, повними порожнечі та \n" +
        "ненависті, можна тільки силою. Херсон звільнено завдяки нашим військовим і спільній підтримці. \n" +
        "Ми ніколи не здамося.</p>",
      images: [
        "/icons/performances/kherson1.webp",
        "/icons/performances/kherson2.webp",
        "/icons/performances/kherson3.webp",
      ],
      composition: [
        {
          name: "Артем Вусик",
          abilities: ["режисер", "сценарист"],
        },
        {
          name: "Павло Бучман",
          abilities: ["звукорежисер"],
        },
        {
          name: "Олеся Стрельбіцька",
          abilities: ["Музикантка", "Сценографістка"],
        },
        {
          name: "Іван Корольов, Кароліна Кудріна",
          abilities: ["Музиканти"],
        },
        {
          name: "Тарас Волох, Світлана Мельник",
          abilities: ["Актори"],
        },
        {
          name: "Артур Рожицький, Антон Репях",
          abilities: ["Актори"],
        },
        {
          name: "Ліза Просолова, Артур Слісаренко",
          abilities: ["Актори"],
        },
      ],
      premiere: "16 ЧЕРВНЯ 2022",
    },
  },

  {
    performanceColor: "#A5886B",
    mobileColor: {
      color: "#CB6565",
      opacity: 0.16,
    },
    rate: "16+",
    title: "Вона Війна",
    description:
      "Яким є жіночий досвід війни? Досвід кожної \n" +
      "із нас, яку ви бачите в трамваї або в стрічці новин. Один і той самий біль нещадно встромлений \n" +
      "у спину. Кожна з нас носить цей ніж у спині \n" +
      "та скільки є сил, можливостей бореться \n" +
      "за кожну спокійну хвилину.",
    type: "Постдокументальна вистава",
    date: "05.09",
    imgUrl: "/icons/poster/img5.webp",
    link: "she-is-war",
    largeDescription: {
      imgUrl: "/icons/poster/bigImg5.webp",
      videoRemarks: [],
      bigTitle1: "Яким є жіночий",
      bigTitle2: "досвід війни?",
      smallTitle:
        "Досвід кожної із нас, <br/>" +
        "яку ви бачите в трамваї <br/>" +
        "або в стрічці новин.",
      description:
        "<p>Ця вистава звучить голосами жінок, дівчат, які розповідають про свої випробування у часи\n" +
        "війни. Про еміграцію, нерівність, виклики, шляхи \n" +
        "подолання психологічної кризи та відновлення \n" +
        "моральної стійкости. Деякі з історій сформували \n" +
        "архетипи, що відтворені на сцені, деякі – \n" +
        "залишилися живим голосом.</p>" +
        "<p>Для збору документального матеріалу режисер \n" +
        "та акторка опитували знайомих жінок дистанційно та наживо, волонтерилина вокзалі, відвідували шелтери для біженок, нотуючи історії. З жіночих \n" +
        "оповідей складалася п’єса, створювалися нові \n" +
        "персонажки. Але на кожному етапі створення \n" +
        "вистави головним правилом була документальна правдивість.</p>" +
        "<p>Один і той самий біль, нещадно встромлений \n" +
        "у спину. Кожна з нас носить цей ніж у спині \n" +
        "та скільки є сил, можливостей бореться за кожну спокійну хвилину. Духовну чи фізичну. Свою або чужу.</p>",
      images: [
        "/icons/performances/sheswar1.webp",
        "/icons/performances/sheswar2.webp",
        "/icons/performances/sheswar3.webp",
      ],
      composition: [
        {
          name: "Костянтин Васюков",
          abilities: ["режисер", "Співавтор сценарію"],
        },
        {
          name: "Світлана Мельник",
          abilities: ["Акторка", "Співавторка сценарію"],
        },
        {
          name: "Олеся Стрельбіцька",
          abilities: ["Сценографістка"],
        },
        {
          name: "Володимир Понікаровський",
          abilities: ["Композитор", "Саунд–дизайнер"],
        },
        {
          name: "Денис Бєляєв",
          abilities: ["Медіа–художник", "режисер монтажу"],
        },
        {
          name: "Денис Бєляєв і Тамілла Гамзаєва",
          abilities: ["2d–анімація"],
        },
      ],
      premiere: "15 липня 2022",
    },
  },
  {
    performanceColor: "#87D0C1",
    mobileColor: {
      color: "#414040",
      opacity: 0.67,
    },
    rate: "16+",
    title: "Як я познайомився з війною і майже вбив путіна",
    description:
      "\n" +
      "Вистава є автобіографічною історією від першої особи, що поєднується із сюрреалістично– фантазійною лінією спроби вбивства путіна. \n" +
      "Це симбіоз аудіального театру з музичним \n" +
      "перфоконцертом – історія пригод і пошуків свого нового місця через втрату попереднього життя.\n" +
      "\n",
    type: "вистава–концерт",
    date: "11.06",
    imgUrl: "/icons/poster/img3.webp",
    link: "kill-pupin",
    largeDescription: {
      imgUrl: "/icons/poster/bigImg3.webp",
      videoRemarks: [
        "У виставі лунає жива музика",
        "Спільний проєкт театру Лесі та театру Варта",
      ],
      bigTitle1: "Що спонукає людину",
      bigTitle2: "до вбивства?",
      smallTitle: "Яке воно — знайомство <br/> з війною?",
      description:
        "<p>Що може спонукнути людину до думки про вбивство? Можливо, те, що вона сама під \n" +
        "загрозою вбивства й кожного дня бачить,\n" +
        "як вбивають людей її держави? У цій виставі cплітаються експериментальна музика, \n" +
        "сновидіння і фантазії про смерть путіна. </p>" +
        "<p>Сюрреалістична постановка з елементами \n" +
        "ґлему та мареннями — як вам таке?\n" +
        "Як це — зображувати того, кого кожного \n" +
        "дня, проклинаючи, згадують сотні людей?</p>" +
        "<p>Вистава в жанрі аудіально-перформативного концерту є автобіографічною історією від першої особи, що поєднується із сюрреалістично–фантазійною лінією спроби вбивства путіна центральним героєм твору.</p>" +
        "<p>Це симбіоз аудіального театру з музичним перфоконцертом – історія пригод і пошуків \n" +
        "свого нового місця через втрату попереднього життя.</p>",
      images: [
        "/icons/performances/warmeet1.webp",
        "/icons/performances/warmeet2.webp",
        "/icons/performances/warmeet3.webp",
      ],
      composition: [
        {
          name: "Артем Вусик",
          abilities: ["режисер", "драматург", "Сценограф"],
        },
        {
          name: "Роман Трубчанінов",
          abilities: ["первофрер", "композитор"],
        },
        {
          name: "Саша Шай",
          abilities: ["первофрер", "композитор"],
        },
        {
          name: "Арсеній Бутирін ",
          abilities: ["первофрер", "композитор"],
        },
      ],
      premiere: "02 липня 2022",
    },
  },

  {
    performanceColor: "#A0E8D8",
    mobileColor: {
      color: "#2F2F2F",
      opacity: 0.67,
    },
    rate: "16+",
    title: "Перший День Війни",
    description:
      "Перформанс-рефлексія, створений у перші дні становлення театру “Варта”. Перформанс-оповідання історій кожного та кожної із нас \n" +
      "у русі, слові, світлині чи музиці. Перформанс-надія на те, що кожного дня ми стаємо \n" +
      "на крок ближче до перемоги.",
    type: "Перформативна вистава",
    date: "23.07",
    imgUrl: "/icons/poster/img6.webp",
    link: "first-day",
    largeDescription: {
      imgUrl: "/icons/poster/bigImg6.webp",
      videoRemarks: ["Присутня обсценна лексика"],
      videoLink:
        "https://www.dramox.com.ua/teatry/254-teatr-varta/419-pershij-den-vijni",
      bigTitle1: "Закарбувався в нас",
      bigTitle2: "назавжди...",
      smallTitle: "напружено затамувався <br/> подих наш тоді <br/> назавжди.",
      description:
        "<p> Перший день війни закарбувався у нас назавжди, напружено затамувався подих наш тоді назавжди.</p>" +
        "<p>Тоді, рано-вранці, ніхто не думав_ла, що житиме інакше, стамувавши подих і навпошепки, навпомацки, крізь новітні реалії пробиратиметься до подоби мирного життя. Гіркої подоби з щоденними новинами, що не вкладаються ні\n" +
        "      в голові, ні в серці.</p>" +
        "<p> Нині ми проживаємо схоже, співчуваємо та очікуємо\n" +
        "      на одне й те ж. Аби одного разу, так само - рано-вранці,\n" +
        "      ми прокинулись і перемогли. </p>" +
        "<p>Але на цій перфомативній виставі давайте спробуємо видихнути хоча б часточку того лютневого, безжально спертого в душах, повітря.</p>" +
        "<p> Ця вистава - це наші переосмислення, взаєморозуміння та підтримка, дивлячись на все це. Це наш спільний видих.</p>",
      images: [
        "/icons/performances/firstday1.webp",
        "/icons/performances/firstday2.webp",
        "/icons/performances/firstday3.webp",
      ],
      composition: [
        {
          name: "Артем Вусик",
          abilities: ["режисер", "сценарист", "Світлове оформлення"],
        },
        {
          name: "Олеся Стрельбіцька",
          abilities: ["Перформерка", "Сценографістка"],
        },
        {
          name: "Арсеній Бутирін",
          abilities: ["Музичне оформлення"],
        },
        {
          name: "Юрій Сулик, Даніїл Пеліхат",
          abilities: ["Перформери", "Музичне оформлення"],
        },
        {
          name: "Аким Драгомирецький, Тарас Волох",
          abilities: ["Перформери"],
        },
        {
          name: "Костянтин Васюков, Антон Репях",
          abilities: ["Перформери"],
        },
        {
          name: "Руслана Петрякова, Іван Дробот",
          abilities: ["Перформери"],
        },
        {
          name: "Артур Рожицький, Ліза Прасолова",
          abilities: ["Перформери"],
        },
        {
          name: "Артур Слусаренко",
          abilities: ["Перформер"],
        },
      ],
      premiere: "27 Березня 2022",
    },
  },
];

export interface PerformanceProps {
  performances: PerformanceType[];
}

export interface PerformanceType {
  performanceColor: string;
  mobileColor: MobileColor;
  rate: string;
  title: string;
  description: string;
  type: string;
  buyLink?: string;
  date: string;
  imgUrl: string;
  link: string;
  largeDescription?: LargeDescription;
}
export interface MobileColor {
  color: string;
  opacity: number;
}

export interface LargeDescription {
  imgUrl: string;
  videoRemarks: string[];
  videoLink?: string;
  bigTitle1: string;
  bigTitle2?: string;
  smallTitle: string;
  description: string;
  images: string[];
  composition: Composition[];
  premiere: string;
}

export interface Composition {
  name: string;
  abilities: string[];
}
