import styled from "@emotion/styled";

const TestArr = [
  {
    title: "Леся і Андрій зустрічаються у Львові",
    description:
      "Сміх, взаємопідтримка, блиск в очах і щирість у серцях завжди надихають жити далі, коли здається, що все йде шкереберть і стає догори дриґом.\n" +
      "\n" +
      "Це історія двох дітей - Лесі та Андрія, котрі під час війни опинилися у Львові, який прихистив їх від снарядів, що розриваються у їхніх рідних містах.\n" +
      "\n" +
      "Познайомившись, вони розпочинають свої пригоди та сміливо допомагають країні боротися зі злом.",
    type: "лялькова вистава в жанрі сучасної казки на 1 дію (50 хвилин)",
    date: "22.04",
    imgUrl: "",
  },
  {
    title: "Перший день війни",
    description:
      "Перфоманс-рефлексія, створений у перші дні становлення театру Варта як такого, митцями й мисткинями з різних міст України, що опинились у Львові під час війни.\n" +
      "\n" +
      "Перфоменс-оповідання історій кожного_ої з нас у русі, слові, світлині чи музиці.\n" +
      "\n" +
      "Перфоменс-надія на те, що кожного дня ми стаємо на крок ближче до перемоги",
    type: "Перфоманс-блуканина на 1 дію (50 хвилин)",
    date: "11.06",
    imgUrl: "",
  },
  {
    title: "Як я познайомився з війною і майже вбив путіна",
    description:
      "Сміх, взаємопідтримка, блиск в очах і щирість у серцях завжди надихають жити далі, коли здається, що все йде шкереберть і стає догори дриґом.\n" +
      "\n" +
      "Це історія двох дітей - Лесі та Андрія, котрі під час війни опинилися у Львові, який прихистив їх від снарядів, що розриваються у їхніх рідних містах.\n" +
      "\n" +
      "Познайомившись, вони розпочинають свої пригоди та сміливо допомагають країні боротися зі злом.",
    type: "лялькова вистава в жанрі сучасної казки на 1 дію (50 хвилин)",
    date: "22.04",
    imgUrl: "",
  },
];

const OurPerformances = () => {
  return <Wrap></Wrap>;
};

export default OurPerformances;

const Wrap = styled.div`
  display: flex;
  flex-direction: column;
  align-items: center;
  padding: 8vh 0;
`;
